src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Счета</name>
  <predefined>
    <items>
      <name>БанковскийСчет</name>
      <description>Банковский счет</description>
    </items>
    <items>
      <name>Карта</name>
      <description>Карта</description>
    </items>
    <items>
      <name>Кошелек</name>
      <description>Кошелек</description>
    </items>
  </predefined>
  <attributes>
    <name>Баланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСчета</name>
    <type>
      <types>EnumRef.ВидСчета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/ОбщийМодульСервер_СистемныеНастройки/Module.bsl
Функция ПолучитьПараметрЗапуска()Экспорт
	Возврат Константы.ПервыйЗапуск.Получить();
КонецФункции

Процедура ПрошелПервыйЗапуск()Экспорт
	Константы.ПервыйЗапуск.Установить(Истина);
КонецПроцедуры

Функция ПолучитьВалютуРегламентированногоУчета()Экспорт	
	Возврат Константы.ВалютаУчета.Получить();	
КонецФункции

Процедура ЗаполнитьПредопределенныеКошелькиНаСервере()Экспорт
	
	ПервыйЗапуск = Константы.ПервыйЗапуск.Получить();
	Если НЕ ПервыйЗапуск Тогда		
		СписокИменСчетов = ПолучитьСписокСчетов();
		Для Каждого ИмяСчета Из СписокИменСчетов Цикл
			СпрОбъект = Справочники.Счета[ИмяСчета].ПолучитьОбъект();
			Если ИмяСчета = "БанковскийСчет" Тогда
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.БанковскийСчет;
			ИначеЕсли ИмяСчета = "Карта" Тогда
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.БанковскаяКарта;
			ИначеЕсли ИмяСчета = "Кошелек" Тогда 
				СпрОбъект.ВидСчета = Перечисления.ВидСчета.Кошелек;
			КонецЕсли;
			Попытка
				СпрОбъект.Записать(); 
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьСписокСчетов()
	
	СписокИменСчетов = Новый Массив;
	СписокИменСчетов.Добавить("БанковскийСчет");
	СписокИменСчетов.Добавить("Карта");
	СписокИменСчетов.Добавить("Кошелек");
	
	Возврат СписокИменСчетов;
	
КонецФункции
